Terraform Format and Style: success
Terraform Initialization: success
Terraform Validation: success
Terraform Plan: success

<details><summary>Show Plan</summary>

```

module.csv_upload_bucket.data.cloudfoundry_space.space: Reading...
module.egress-space.data.cloudfoundry_org.org: Reading...
module.sns_sms.data.cloudfoundry_space.space: Reading...
module.database.data.cloudfoundry_space.space: Reading...
data.cloudfoundry_org.org: Reading...
module.sns_sms.data.cloudfoundry_service.sns: Reading...
module.redis.data.cloudfoundry_service.redis: Reading...
module.ses_email.data.cloudfoundry_space.space: Reading...
module.ses_email.data.cloudfoundry_service.ses: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Reading...
module.redis.data.cloudfoundry_service.redis: Read complete after 0s [id=045871d3-d9a8-4a9b-a844-00a067fab054]
module.redis.data.cloudfoundry_space.space: Reading...
module.egress-space.data.cloudfoundry_org.org: Read complete after 0s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.database.data.cloudfoundry_service.rds: Reading...
data.cloudfoundry_org.org: Read complete after 0s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.egress-space.cloudfoundry_space.public_egress: Refreshing state... [id=fa2417a9-297e-40e0-a517-f4f1f4989556]
module.csv_upload_bucket.data.cloudfoundry_service.s3: Read complete after 0s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.egress-space.data.cloudfoundry_user.users["steven.reilly@gsa.gov"]: Reading...
module.sns_sms.data.cloudfoundry_service.sns: Read complete after 0s [id=ed5b0e74-dacc-4511-8514-410bef51b554]
module.egress-space.data.cloudfoundry_user.users["bbb35677-6906-4f8d-b230-bb4755d7886a"]: Reading...
module.ses_email.data.cloudfoundry_space.space: Read complete after 0s [id=0b28b133-9f7b-49f1-9f34-a179cbb2549f]
module.database.data.cloudfoundry_space.space: Read complete after 0s [id=0b28b133-9f7b-49f1-9f34-a179cbb2549f]
module.ses_email.data.cloudfoundry_service.ses: Read complete after 0s [id=8a75c59c-0c4b-4764-907c-b0760c7278a0]
module.ses_email.cloudfoundry_service_instance.ses: Refreshing state... [id=a113b8a3-5a87-4920-85c6-00c18a8c389e]
module.csv_upload_bucket.data.cloudfoundry_space.space: Read complete after 0s [id=0b28b133-9f7b-49f1-9f34-a179cbb2549f]
module.csv_upload_bucket.cloudfoundry_service_instance.bucket: Refreshing state... [id=59028298-4427-4516-907d-097d99dda5c5]
module.sns_sms.data.cloudfoundry_space.space: Read complete after 0s [id=0b28b133-9f7b-49f1-9f34-a179cbb2549f]
module.sns_sms.cloudfoundry_service_instance.sns: Refreshing state... [id=dfa60432-eab1-456b-8a24-9a34312939ed]
module.egress-space.data.cloudfoundry_user.users["steven.reilly@gsa.gov"]: Read complete after 0s [id=ffd00a3e-aa1a-42e1-a81a-5f60420658c2]
module.egress-space.data.cloudfoundry_user.users["bbb35677-6906-4f8d-b230-bb4755d7886a"]: Read complete after 0s [id=74b9cc1c-d8fa-4e70-8eba-c7d66343ad9c]
module.redis.data.cloudfoundry_space.space: Read complete after 0s [id=0b28b133-9f7b-49f1-9f34-a179cbb2549f]
module.redis.cloudfoundry_service_instance.redis: Refreshing state... [id=c6d73ed7-69ba-4720-a459-7b80200006c8]
module.database.data.cloudfoundry_service.rds: Read complete after 1s [id=dcfb1d43-f22c-42d3-962c-7ae04eda24e7]
module.database.cloudfoundry_service_instance.rds: Refreshing state... [id=9360890e-0458-41d0-99ce-071ce7f5bef9]
module.egress-space.cloudfoundry_space_users.deployers: Refreshing state... [id=63a559ae-ceb6-3066-9eb0-b57347e2bece]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudfoundry_space.notify-demo will be created
  + resource "cloudfoundry_space" "notify-demo" {
      + allow_ssh                = (known after apply)
      + auditors                 = (known after apply)
      + delete_recursive_allowed = false
      + developers               = (known after apply)
      + id                       = (known after apply)
      + managers                 = (known after apply)
      + name                     = "notify-demo"
      + org                      = "9e428562-a2d9-41b4-9c23-1ef5237fb44e"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.csv_upload_bucket.cloudfoundry_service_instance.bucket,
  on .terraform/modules/csv_upload_bucket/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ccostino, Action: `pull_request`*